xunserver/remote-input/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_REMOTE_INPUT_WS_ENABLED=y
CONFIG_REMOTE_INPUT_WIFI_AP_SSID="Remote-Input-S3"
CONFIG_REMOTE_INPUT_WIFI_AP_PASSWORD="remoteinput"
CONFIG_REMOTE_INPUT_WIFI_AP_CHANNEL=6
CONFIG_REMOTE_INPUT_WS_MAX_CLIENTS=1
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_REMOTE_INPUT_DISPLAY_ENABLED=y
# The firmware only uses LVGL core widgets; compiling bundled examples adds
# hundreds of source files to clean builds.
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
